"STORE_DESCRIPTION" = "VLC é um reprodutor de multimédia multiplataforma de código aberto.\nEste pode reproduzir diretamente todos os seus filmes, programas e músicas na maioria dos formatos sem conversão.\nEste permite-lhe sincronizar ficheiros com Box, Dropbox, Google Drive, iCloud Drive, iTunes e OneDrive, transferências diretas e via partilha em Wi-Fi, bem como reproduzir através de servidores de multimédia FTP, NFS, SFTP, SMB, UPnP/DLNA e na Web.\nVLC é compatível com legendas avançadas, incluindo compatibilidade total com SSA, múltiplas faixas de áudio, controlo de velocidade da reprodução e renderização via Chromecast.\n\nVLC é totalmente gratuito e de código aberto.";

"STORE_DESCRIPTION_TV" = "O VLC é um leitor multimédia multiplataforma gratuito e de código aberto.\nPode reproduzir todos os seus filmes, programas e música na maioria dos formatos diretamente sem conversão.\nPermite a reprodução remota a partir do seu Mac ou PC através de uma interface Web, bem como a transmissão a partir de servidores multimédia SMB, FTP, SFTP, NFS, UPnP/DLNA e da Web.\nO VLC oferece suporte para legendas avançadas, incluindo compatibilidade total com SSA, áudio multipista e controlo da velocidade de reprodução.\n\nO VLC é totalmente gratuito e de código aberto.\n\nA arte é fornecida pelo TMDb, que é uma base de dados de filmes mantida pela comunidade.";

"UNKNOWN_TRACK_TYPE" = "Tipo de faixa desconhecida";
"CHOOSE_TITLE" = "Escolha um título";
"CHOOSE_CHAPTER" = "Escolha um capítulo";
"CHAPTER_SELECTION_TITLE" = "Capítulos ";
"TITLE" = "Título";
"CHAPTER" = "Capítulo";
"TRACK_SELECTION" = "Seleção de faixa";
"AUDIO" = "Áudio";
"SUBTITLES" = "Legendas";
"LANGUAGE" = "Idioma";
"MEDIA_INFO" = "Informação do Ficheiro";
"VIDEO_DIMENSIONS" = "Dimensões do vídeo";
"FORMAT_VIDEO_DIMENSIONS" = "%ix%i píxel";
"FORMAT_AUDIO_TRACKS" = "%i faixas de áudio";
"ONE_AUDIO_TRACK" = "1 faixa de áudio";
"FORMAT_SPU_TRACKS" = "%i faixas de legendas";
"ONE_SPU_TRACK" = "1 faixa de legendas";
"TRACKS" = "%i faixas";
"TRACK" = "%i faixa";
"TRACKS_DURATION" = "%u faixas, duração: %@";
"NB_ALBUM_FORMAT" = "%i álbum";
"NB_ALBUMS_FORMAT" = "%i álbuns";

"PLAYING_EXTERNALLY_TITLE" = "Ligado à TV";
"PLAYING_EXTERNALLY_DESC" = "Este vídeo está a ser reproduzido na TV";
"PLAYING_EXTERNALLY_ADDITION" = "\n A reproduzir agora em:"; /* \n should stay in every translation */

"VFILTER_HUE" = "Tonalidade";
"VFILTER_CONTRAST" = "Contraste";
"VFILTER_BRIGHTNESS" = "Brilho";
"VFILTER_SATURATION" = "Saturação";
"VFILTER_GAMMA" = "Gama";

"PRESET_PREAMP_SETTING" = "Definições de pré-ajuste/pré-amplificador";
"PREAMP" = "Amplificador";
"SNAP_BANDS" = "Atrair bandas";

"PLAYBACK_FAILED" = "Não foi possível reproduzir";
"PLEASE_WAIT" = "Por favor, aguarde";
"AR_CHANGED" = "Formato: %@";
"DEFAULT" = "Predefinição";
"FILL_TO_SCREEN" = "Recortar para preencher o ecrã";
"PLAYBACK_SPEED" = "Velocidade de reprodução";
"SPU_DELAY" = "Atraso das legendas";
"AUDIO_DELAY" = "Atraso do áudio";
"BUTTON_SLEEP_TIMER" = "Temporizador";
"SLEEP_TIMER_UPDATED" = "Temporizador atualizado";
"CONTINUE_PLAYBACK" = "Continuar reprodução?";
"CONTINUE_PLAYBACK_LONG" = "Pretende continuar a reprodução de “%@” a partir da última posição?";

"BUTTON_ABOUT" = "Sobre";
"BUTTON_BACK" = "Anterior";
"BUTTON_DONE" = "OK";
"BUTTON_CANCEL" = "Cancelar";
"BUTTON_SAVE" = "Guardar";
"BUTTON_DOWNLOAD" = "Transferir";
"BUTTON_DELETE" = "Apagar";
"BUTTON_OK" = "OK";
"BUTTON_DISMISS" = "Descartar";
"BUTTON_CONTACT" = "Contacte-nos";
"BUTTON_CONNECT" = "Ligar";
"BUTTON_RENAME" = "Renomear";
"BUTTON_LEARN_MORE" = "Saiba mais";
"BUTTON_LOGOUT" = "Terminar sessão";
"BUTTON_CONTINUE" = "Continuar";
"BUTTON_SET" = "Definir";
"BUTTON_RESET" = "Repor";
"BUTTON_RESCAN" = "Verificar novamente";
"PRIVATE_PLAYBACK_TOGGLE" = "Reprodução privada";
"SCAN_SUBTITLE_TOGGLE" = "Procurar por legendas (apenas http)";

"BUTTON_RENDERER" = "Dispositivos de transmissão";
"BUTTON_RENDERER_HINT" = "Mostrar um menu de dispositivos de transmissão disponíveis";
"BUTTON_AIRPLAY" = "AirPlay ou Bluetooth";
"BUTTON_AIRPLAY_HINT" = "Mostrar um menu de dispositivos AirPlay ou Bluetooth disponíveis";

"UPGRADING_LIBRARY" = "Atualização da Mediateca";

"FAVORITES" = "Favoritos";
"NO_FAVORITES" = "Ainda não existem favoritos";
"NO_FAVORITES_DESCRIPTION" = "Marque as suas pastas favoritas enquanto navega nos servidores para as ter listadas aqui.";
"ADD_FAVORITE" = "Adicionar aos favoritos";
"REMOVE_FAVORITE" = "Remover dos favoritos";
"FAVORITE_ALERT_TITLE" = "Gostaria de adicionar esta pasta aos seus favoritos?";
"UNFAVORITE_ALERT_TITLE" = "Gostaria de remover esta pasta dos seus favoritos?";

"OPEN_NETWORK" = "Abrir transmissão em rede";
"NETWORK_TITLE" = "Transmissão em rede";
"OPEN_NETWORK_HELP" = "Digite qualquer endereço HTTP, RTSP, RTMP, MMS, FTP ou UDP/RTP para abrir diretamente a transmissão.";
"HTTP_UPLOAD_SERVER_OFF" = "Servidor Inativo";
"HTTP_UPLOAD_NO_CONNECTIVITY" = "Sem ligação Wi-Fi ativa";
"OPEN_STREAM_OR_DOWNLOAD" = "Gostaria de transferir ou reproduzir este URL?";
"ALWAYS_STREAM_URL" = "Reproduzir sempre URLs";
"SHARED_VLC_IOS_LIBRARY" = "Biblioteca partilhada do VLC para iOS";
"SMB_CIFS_FILE_SERVERS" = "Servidores de ficheiros (SMB)";

"MANAGED_SERVERS" = "Gerido";

"SMB_CIFS_FILE_SERVERS_SHORT" = "SMB";

"HTTP_DOWNLOAD_CANCELLED" = "Transferência cancelada pelo utilizador";

"DOWNLOAD_FROM_HTTP" = "Transferências";
"ERROR_NUMBER" = "Ocorreu um erro (%i)";
"DOWNLOAD_FAILED" = "Transferência falhou";
"FILE_NOT_SUPPORTED" = "Formato de ficheiro não suportado";
"FILE_NOT_SUPPORTED_LONG" = "O formato de ficheiro utilizado por %@ não é suportado por esta versão do VLC para iOS.";
"SCHEME_NOT_SUPPORTED" = "Esquema de endereço não suportado";
"SCHEME_NOT_SUPPORTED_LONG" = "O esquema de endereço (%@) não é suportado. Por favor, use um endereço que comece por HTTP, HTTPS ou FTP.";
"RENAME_MEDIA_TO" = "Digite um novo nome para %@";

"FOLDER_EMPTY" = "Pasta vazia";

"SHARING_ACTION_SHEET_TITLE_CHOOSE_FILE" = "Escolha um ficheiro para abrir:";
"SHARING_ACTIVITY_OPEN_IN_TITLE" = "Abrir com…";
"SHARING_ERROR_NO_FILES" = "Não foi possível encontrar ficheiros para partilhar";
"SHARING_ERROR_NO_APPLICATIONS" = "Não foi possível encontrar aplicações para abrir este tipo de ficheiros";
"SHARING_SUCCESS_CAMERA_ROLL" = "O ficheiro foi guardado com sucesso no Rolo da câmara.";

"FAVORITEVC_DETAILTEXT" = "Ver as suas pastas favoritas";
"STREAMVC_DETAILTEXT" = "Reproduzir diretamente transmissões sem transferir";
"DOWNLOADVC_DETAILTEXT" = "Transferir os ficheiros diretamente para o seu dispositivo";
"HEADER_TITLE_RENDERER" = "Selecionar um dispositivo de transmissão";

"BROWSE" = "Explorar";
"NETWORK" = "Rede";
"LOCAL_NETWORK" = "Rede local";
"CONNECT_TO_SERVER" = "Ligar ao servidor";
"FILE_SERVER" = "Servidores de Ficheiro";
"USER_LABEL" = "Nome de utilizador";
"PASSWORD_LABEL" = "Palavra-passe";
"DISABLE_LABEL" = "Desativar";
"BUTTON_ANONYMOUS_LOGIN" = "Sessão anónima";

"LOCAL_SERVER_REFRESH" = "Atualizar";
"LOCAL_SERVER_LAST_UPDATE" = "Última atualização: %@";
"LOCAL_SERVER_CONNECTION_FAILED_TITLE" = "A LIGAÇÃO AO SERVIDOR FALHOU";
"LOCAL_SERVER_CONNECTION_FAILED_MESSAGE" = "Por favor, verifique o endereço do servidor e os detalhes de início de sessão.";

"FILES_APP_CELL_TITLE" = "Ficheiros locais";
"FILES_APP_CELL_SUBTITLE" = "Abrir um ficheiro sem copiá-lo para VLC";

"CLOUD_SERVICES" = "Serviços na nuvem";
"LOGIN" = "Iniciar sessão";
"LOGGED_IN" = "Sessão iniciada";
"LOGGED_IN_SERVICES" = "%d com sessão iniciada nos serviços";
"LOGGED_IN_SERVICE" = "1 com sessão iniciada no serviço";

"DROPBOX_DOWNLOAD" = "Transferir o ficheiro?";
"DROPBOX_DL_LONG" = "Gostaria de transferir “%@” para o seu %@?";
"DROPBOX_LOGIN" = "Iniciar sessão";

"GDRIVE_ERROR_FETCHING_FILES" = "Ocorreu um erro enquanto obtinha os ficheiros";
"GDRIVE_DOWNLOAD_SUCCESSFUL" = "O seu ficheiro foi transferido com sucesso";
"GDRIVE_DOWNLOAD_SUCCESSFUL_TITLE" = "CONCLUÍDO";
"GDRIVE_ERROR_DOWNLOADING_FILE" = "Ocorreu um erro durante a transferência";
"GDRIVE_ERROR_DOWNLOADING_FILE_TITLE" = "ERRO";

"ONEDRIVE_MEDIA_WITHOUT_URL" = "O média selecionado não tem um URL que possa ser reproduzido";

"DISK_FULL" = "Armazenamento completo";
"DISK_FULL_FORMAT" = "%@ não pode ser armazenado no seu %@, porque não há espaço livre suficiente.";

"NUM_OF_FILES" = "%i ficheiros";
"ONE_FILE" = "1 ficheiro";
"NO_FILES" = "Nenhum ficheiro suportado";
"DOWNLOADING" = "A transferir…";
"REMAINING_TIME" = "Tempo restante: %@";
"BIOMETRIC_UNLOCK" = "Desbloquear a Mediateca\nCancelar para inserir 'Código'";

// Passcode Strings that we need to localize for them
"Set Passcode" = "Definir Código";
"Enter Passcode" = "Introduzir Código";
"Enter a passcode" = "Introduzir um código";
"Enter your passcode" = "Introduza o seu código";
"Passcodes did not match. Try again." = "Os códigos não coincidem. Tente novamente.";
"Re-enter your passcode" = "Reinsira o seu código";
"Passcode Options" = "Opções de código";
"4-Digit Numeric Code" = "Código numérico de 4 dígitos"; /* Passcode 4 digit numeric code */
"6-Digit Numeric Code" = "Código numérico de 6 dígitos"; /* Passcode 6 digit numeric code */

"Settings" = "Definições"; // plain text key to keep compatibility with InAppSettingsKit's upstream
"ON" = "Sim";
"OFF" = "Não";

"EMPTY_LIBRARY" = "Mediateca Vazia";
"EMPTY_LIBRARY_LONG" = "Para a reprodução, pode transmitir multimédia a partir de um servidor na sua rede local, da nuvem ou sincronizar multimédia para o seu dispositivo utilizando o iTunes, o envio por Wi-Fi ou os serviços da nuvem.";

"EMPTY_NO_PLAYLISTS" = "Listas de reprodução";
"EMPTY_NO_PLAYLISTS_DESCRIPTION" = "Para criar listas de reprodução, entre no modo Editar nos separadores conteúdo de Vídeo ou Áudio e selecione os seus conteúdos multimédia favoritos.\nTambém pode sincronizar listas de reprodução existentes a partir dos seus outros dispositivos ou da Internet.";

"EMPTY_PLAYLIST" = "Lista de reprodução vazia";
"EMPTY_PLAYLIST_DESCRIPTION" = "Adicione média durante a edição nas respectivas categorias.";

"EMPTY_HISTORY" = "Histórico vazio";
"EMPTY_HISTORY_DESCRIPTION" = "Ainda não há média.";

"EMPTY_MEDIA_LIST" = "Lista de média vazia";
"EMPTY_MEDIA_LIST_DESCRIPTION" = "A lista de média está vazia, pelo que não foi possível iniciar a reprodução";

"PLAYBACK_SCRUB_HELP" = "Deslize o dedo para cima para ajustar a velocidade do avanço.";
"PLAYBACK_SCRUB_HIGH" = "Avanço rápido";
"PLAYBACK_SCRUB_HALF" = "Avanço médio";
"PLAYBACK_SCRUB_QUARTER" = "Avanço lento";
"PLAYBACK_SCRUB_FINE" = "Avanço preciso";
"PLAYBACK_SCRUB_TOTAL_TIME_FORMAT" = "%@ decorrido, duração total %@"; /* 1: elapsed time, 2: total time */
"PLAYBACK_SCRUB_REMAINING_TIME_FORMAT" = "%@ decorrido, %@"; /* 1: elapsed time, 2: remaining time */
"PLAYBACK_SCRUB_ACCESSIBILITY_TIME_DISPLAY" = "Exibição da hora";
"PLAYBACK_POSITION" = "Posição da reprodução";
"VIDEO_FILTER" = "Filtros de vídeos";
"VIDEO_FILTER_RESET_BUTTON" = "Repor os filtros de vídeos";
"VIDEO_ASPECT_RATIO_BUTTON" = "Proporção do vídeo";
"BWD_BUTTON" = "Ir para trás";
"FWD_BUTTON" = "Ir para a frente";
"PLAY_BUTTON" = "Reproduzir";
"NEXT_BUTTON" = "Seguinte";
"PREV_BUTTON" = "Anterior";
"PLAY_ALL_BUTTON" = "Reproduzir tudo";
"PLAY_ALL_HINT" = "Reproduzir todas as médias da coleção";

"RESET_VIDEO_FILTERS" = "Quer repor os filtros de vídeo?";
"RESET_PLAYBACK_SPEED" = "Quer repor a velocidade de reprodução?";
"RESET_EQUALIZER" = "Quer repor as definições do equalizador?";
"RESET_SLEEP_TIMER" = "Quer repor o temporizador de sono?";

"CUSTOM_EQUALIZER_PROFILES" = "Perfis personalizados";
"DEFAULT_PROFILE_NAME" = "Perfil personalizado";
"CUSTOM_EQUALIZER_ALERT_TITLE" = "Guardar novo perfil";
"CUSTOM_EQUALIZER_ALERT_MESSAGE" = "Pretende guardar um novo perfil com os valores selecionados?";
"RENAME_CUSTOM_PROFILE_TITLE" = "Mudar o nome do perfil";
"DELETE_CUSTOM_PROFILE_TITLE" = "Eliminar o perfil";
"DELETE_CUSTOM_PROFILE_MESSAGE" = "Quer eliminar o perfil selecionado?";

"VERSION_FORMAT" = "Versão: %@";
"BASED_ON_FORMAT" = "Baseado no:<br />%@";

"NEW" = "NOVO";

"VO_VIDEOPLAYER_TITLE" = "Reprodutor de vídeos";
"VO_VIDEOPLAYER_DOUBLETAP" = "Dê dois toques para mostrar ou ocultar os controlos de reprodução";

"FIRST_STEPS_ITUNES" = "Sincronização de ficheiros";
"FIRST_STEPS_ITUNES_TITLE" = "Sincronizar com o seu computador";
"FIRST_STEPS_ITUNES_DETAILS" = "Conecte o seu %@ para utilizar o Finder ou o iTunes para \"Partilha de ficheiros\". Selecione o VLC para transferir ficheiros.";
"FIRST_STEPS_WIFI_TITLE" = "Partilhar via Wi-Fi";
"FIRST_STEPS_WIFI_DETAILS" = "Introduza o URL gerado no seu navegador web favorito enquanto estiver ligado à mesma rede que o seu %@.";
"FIRST_STEPS_CLOUDS" = "Nuvens";
"FIRST_STEPS_CLOUD_TITLE" = "Nuvem";
"FIRST_STEPS_CLOUD_DETAILS" = "Envie a sua mediateca para um serviço da nuvem, tais como Dropbox ou Google Drive para a transferir ou transmitir remotamente.";

"PLEX_CHECK_ACCOUNT" = "Verifique a sua conta Plex nas definições";
"PLEX_ERROR_ACCOUNT" = "Erro ao iniciar sessão no Plex";

"UNAUTHORIZED" = "Não autorizado";

"SERVER" = "Servidor";
"SERVER_PORT" = "Porta";
"NO_SERVER_FOUND" = "Nenhum servidor encontrado";
"NO_RECENT_STREAMS" = "Não foi reproduzida nenhuma transmissão recentemente";

"WEBINTF_TITLE" = "Partilhar via Wi-Fi";
"WEBINTF_ETHERNET" = "Partilhar via Ethernet";
"WEBINTF_DROPFILES" = "Solte os ficheiros";
"WEBINTF_DROPFILES_LONG" = "Solte os ficheiros na janela para os adicionar ao seu %@.<br>Ou clique no botão \"+\" para utilizar o seletor de ficheiros.";
"WEBINTF_DOWNLOADFILES" = "Transferir Ficheiros";
"WEBINTF_DOWNLOADFILES_LONG" = "Basta clicar no ficheiro que pretende transferir do seu %@.";
"WEBINTF_ADDRESS_COPIED" = "Endereço copiado para a área de transferência";
"WEBINTF_TITLE_ATV" = "Reprodução remota";
"WEBINTF_DROPFILES_LONG_ATV" = "Solte os ficheiros na janela para os reproduzir no seu %@.<br>Ou clique no botão “+” para utilizar o seletor de ficheiros.";
"WEBINTF_URL_SENT" = "URL enviado com sucesso.";
"WEBINTF_URL_EMPTY" = "O URL não pode estar vazio.";
"WEBINTF_URL_INVALID" = "Não é um URL válido.";
"WEBINTF_AUTH_REQUIRED" = "Por favor, insira o código que definiu no VLC iOS:";
"WEBINTF_AUTH_WRONG_PASSCODE" = "Código errado.<br> Tentativas restantes: ";
"WEBINTF_AUTH_BANNED" = "Inseriu muitos códigos errados.<br>Por favor, reinicie o VLC iOS e tente novamente.";

"DURATION" = "Duração";
"TITLE" = "Título";
"ROTATE_BUTTON" = "Rodar"; /* Accessibility label for rotate button on the player */
"ROTATE_BUTTON_HINT" = "Alterna o reprodutor de vídeo entre o modo paisagem e retrato."; /* Accessibility hint for rotate button on the player */

"AUDIO_INFO_VC_TITLE" = "Informação Àudio";
"ENTER_URL" = "Digite o URL a reproduzir";
"HTTP_SERVER_ON" = "Desativar reprodução remota";
"HTTP_SERVER_OFF" = "Ativar reprodução remota";
"CACHED_MEDIA" = "Multimédia em cache";
"CACHED_MEDIA_LONG" = "Os ficheiros mostrados nesta página são guardados localmente na sua Apple TV. Estes conteúdos podem ser removidos pelo sistema operativo, sem aviso prévio quanto o VLC não está aberto, no caso do seu dispositivo ficar sem espaço de armazenamento.";
"DOWNLOAD_SUBS_FROM_OSO" = "Descarregar legendas...";
"FOUND_SUBS" = "Legendas encontradas";
"NO_SUB_FOUND_OSO" = "Não foram encontradas legendas para o seu item multimédia \"%@\".";
"SELECT_AUDIO_FROM_FILES" = "Carregar áudio externo...";
"SELECT_SUBTITLE_FROM_FILES" = "Carregar legendas externas...";
"USE_SPDIF" = "Usar Passagem (S/PDIF)";

"PLAYBACK" = "Reprodução";
"REPEAT_MODE" = "Repetir";
"REPEAT_DISABLED" = "Desativada";
"REPEAT_SINGLE" = "Do elemento";
"REPEAT_FOLDER" = "Pasta";
"SHUFFLE" = "Aleatório";
"SHUFFLE_DISABLED" = "Aleatório desativado";

"RESET_NETWORK_STREAM_LIST_TITLE" = "Limpar lista";
"RESET_NETWORK_STREAM_LIST_TEXT" = "Eliminar permanentemente a lista de transmissões de rede reproduzidas recentemente.";

// MARK: - Local Network Service Names
"UPNP_LONG" = "Universal Plug'n'Play (UPnP)";
"UPNP_SHORT" = "UPnP";

"PLEX_LONG" = "Plex Media Server (via Bonjour)";
"PLEX_SHORT" = "Plex";

"FTP_SHORT" = "FTP";
"SFTP_SHORT" = "SFTP";

"NFS_LONG" = "Sistema de Ficheiros de Rede (NFS)";
"NFS_SHORT" = "NFS";

"BONJOUR_FILE_SERVERS" = "Servidor de Ficheiros BONJOUR";
"DSM_WORKGROUP" = "Grupo de trabalho";

"URL_NOT_SUPPORTED" = "O URL não pode ser aberto";

// Insert %@ where play-pause-glyph should be placed
"DELETE_ITEM_HINT" = "Pressione %@ para apagar"; /* Insert %@ where play-pause-glyph should be placed */
"DELETE_MESSAGE" = "Confirme a eliminação da seleção";
"DELETE_MESSAGE_PLAYLIST" = "Tem a certeza que deseja eliminar a lista de reprodução selecionada?\nOs ficheiros de média associados não serão eliminados.";
"DELETE_MESSAGE_PLAYLIST_CONTENT" = "Tem a certeza que deseja remover os média selecionados da lista de reprodução?\nEles não serão eliminados do disco.";

// MARK: - Drag and Drop

"PROTOCOL_NOT_SELECTED" = "Protocolo não selecionado";
"Settings" = "Definições";

"ERROR" = "Erro";
"SORT" = "Ordenar";
"SORT_BY" = "Ordenar por";
"SEARCH" = "Procurar";
"VIDEO" = "Vídeo";

// MARK: - MediaViewController Swipable Header
"ALBUMS" = "Álbuns";
"ARTISTS" = "Artistas";
"EPISODES" = "Episódios";
"GENRES" = "Géneros";
"ALL_VIDEOS" = "Todos os vídeos";
"SONGS" = "Músicas";
"PLAYLISTS" = "Listas de reprodução";
"VIDEO_GROUPS" = "Grupos de vídeos";
"HISTORY" = "Histórico";
"MODIFIED_DATE" = "Data de alteração";
"NAME" = "Nome";

// MARK: - EDIT

"BUTTON_MENU" = "Menu";
"BUTTON_MENU_HINT" = "Selecionar, reordenar e ordenar os itens de média presentes nesta vista";

"BUTTON_EDIT" = "Editar";
"BUTTON_EDIT_HINT" = "Modo de edição";

"BUTTON_SELECT" = "Selecionar";
"BUTTON_SELECT_HINT" = "Botão de seleção";

"BUTTON_SELECT_ALL" = "Selecionar tudo";
"BUTTON_SELECT_ALL_HINT" = "Selecionar todos os itens de média presentes nesta vista";

"BUTTON_HISTORY" = "Histórico";
"BUTTON_HISTORY_HINT" = "Ver os seus ficheiros multimédia recentemente reproduzidos";

"BUTTON_CLEAR" = "Limpar ";
"CLEAR_HISTORY_TITLE" = "Limpar histórico";
"CLEAR_HISTORY_MESSAGE" = "Confirmar limpeza do histórico";

"ADD_TO_PLAYLIST" = "Adicionar à lista de reprodução";
"ADD_TO_PLAYLIST_HINT" = "Abrir o menu de adicionar à lista de reprodução";

"PLAY_AS_AUDIO" = "Reproduzir como áudio";
"PLAY_AS_AUDIO_HINT" = "Reproduzir o ficheiro de vídeo como um ficheiro de áudio.";

"PLAYLIST_PLACEHOLDER" = "Título da lista de reprodução";
"PLAYLIST_DESCRIPTION" = "Escolha um título para a sua nova lista de reprodução";
"PLAYLIST_CREATION" = "Criar uma nova lista de reprodução";
"PLAYLIST_CREATION_HINT" = "Mostrar uma ação interativa para criar uma lista de reprodução";
"ERROR_PLAYLIST_CREATION" = "Não foi possível criar uma lista de reprodução";
"ERROR_PLAYLIST_TRACKS" = "Não foi possível obter as faixas";

"ERROR_RENAME_FAILED" = "A renomeação falhou";
"ERROR_EMPTY_NAME" = "O título não pode estar em branco";

"SHARE_LABEL" = "Partilhar";
"SHARE_HINT" = "Partilhar os ficheiros selecionados";
"RENAME_HINT" = "Renomear os ficheiros selecionados";
"DELETE_HINT" = "Eliminar os ficheiros selecionados";

"ADDITIONAL_OPTIONS" = "Opções adicionais";

// MARK: - Sort

"BUTTON_SORT" = "Ordenar";
"BUTTON_SORT_HINT" = "Exibir a folha da ação de ordenar";
"HEADER_TITLE_SORT" = "Ordenar por";
"DESCENDING_LABEL" = "Ordem Descendente";
"DESCENDING_SWITCH_LABEL" = "Ordem ascendente ou descendente";
"DESCENDING_SWITCH_HINT" = "Ordenar contexto na ordem ascendente ou descendente";
"GRID_LAYOUT" = "Grelha";
"GRID_LAYOUT_HINT" = "Mostrar os itens numa grelha";
"LIST_LAYOUT" = "Lista";
"HIDE_FEAT_ARTISTS" = "Ocultar artistas participantes";
"HIDE_TRACK_NUMBERS" = "Mostrar números das faixas";

// MARK: - VLCMediaLibraryKit - Sorting Criteria

"ALPHA" = "Alfanumericamente";
"DURATION" = "Duração";
"INSERTION_DATE" = "Data de inserção";
"LAST_MODIFICATION_DATE" = "Data da última alteração";
"RELEASE_DATE" = "Data de lançamento";
"FILE_SIZE" = "Tamanho do ficheiro";
"ARTIST" = "Artista";
"PLAY_COUNT" = "Número de reproduções";
"ALBUM" = "Álbum";
"FILENAME" = "Nome do ficheiro";
"TRACK_NUMBER" = "Número da faixa";
"NB_AUDIO" = "Número de áudio";
"NB_MEDIA" = "Número de média";
"NB_VIDEO" = "Número de vídeo";
"NB_ALBUM" = "Número de álbuns";
"LAST_PLAYBACK_DATE" = "Última data de reprodução";
"TRACK_ID" = "Id. da faixa";
"CUSTOM" = "Personalizado";

// MARK: - VLCNetworkLoginTVViewController

"NO_SAVING_DATA" = "Nada encontrado";

// MARK: - MediaCollectionViewCell

"UNKNOWN_ARTIST" = "Artista Desconhecido";
"VARIOUS_ARTIST" = "Vários Artistas";
"UNKNOWN_ALBUM" = "Álbum Desconhecido";
"SINGLE_ITEM_SELECTED" = "item selecionado";
"MULTIPLE_ITEMS_SELECTED" = "itens selecionados";

// MARK: - VideoPlayerControls

"SUBTITLE_AND_TRACK_BUTTON" = "Legendas e faixas áudio";
"SUBTITLE_AND_TRACK_HINT" = "Escolha legendas e faixas áudio";

"DVD_BUTTON" = "DVD";
"DVD_HINT" = "Interface do DVD";

"ROTATION_LOCK_BUTTON" = "Bloqueio da rotação";
"ROTATION_LOCK_HINT" = "Bloquear o vídeo na orientação atual";

"REPEAT_HINT" = "Repetir a mesma média";
"DO_NOT_REPEAT_HINT" = "Não repetir a lista de média";
"REPEAT_ALL_HINT" = "Repetir a lista de média";

"BACKWARD_BUTTON" = "Recuar";
"BACKWARD_HINT" = "Salta para trás";

"PREVIOUS_BUTTON" = "Anterior";
"PREVIOUS_HINT" = "Média anterior";

"PLAY_PAUSE_BUTTON" = "Reproduzir ou pausar";
"PLAY_PAUSE_HINT" = "Reproduzir ou pausar a reprodução atual";

"STOP_BUTTON" = "Parar";
"CLOSE_HINT" = "Parar a reprodução";

"MINIMIZE_BUTTON" = "Minimizar";
"MINIMIZE_HINT" = "Minimizar o reprodutor";

"NEXT_HINT" = "Próxima média";

"FORWARD_BUTTON" = "Avançar";
"FORWARD_HINT" = "Salta para a frente";

"INTERFACE_LOCK_BUTTON" = "Bloquear interface";

"SELECT_A_MARK" = "Selecione a marca A";
"SELECT_A_MARK_HINT" = "Selecione a marca A da repetição AB";
"SELECT_B_MARK" = "Selecione a marca B";
"SELECT_B_MARK_HINT" = "Selecione a marca B da repetição AB";

"AB_LOOP" = "Ciclo A→B";
"AB_LOOP_MARKS" = "Marcas de ciclo A→B";

"RESET_AB_LOOP" = "Quer remover o ciclo A→B?";
"RESET_AB_LOOP_MARKS" = "Quer repor as marcas do ciclo A→B?";

"SHUFFLE_HINT" = "Baralhar a lista de média";
"SHUFFLE_OFF_HINT" = "Não baralhar a lista de média";

"ASPECT_RATIO_TITLE" = "Proporção";
"VIDEO_ASPECT_RATIO_BUTTON" = "Proporção do vídeo";
"VIDEO_ASPECT_RATIO_HINT" = "Alterar a proporção do vídeo atual";

"MORE_OPTIONS_BUTTON" = "Mais";
"MORE_OPTIONS_HINT" = "Ver mais opções de controlos";

"PLAYBACK_CONTROLS_BAR_TITLE" = "Controlos de reprodução";
"PLAYBACK_CONTROLS_BAR_HINT" = "Pausa, procura, capítulo seguinte";

"PLAYER_WARNING_SUBTITLE_CAST_TITLE" = "Legendas não suportadas";
"PLAYER_WARNING_SUBTITLE_CAST_DESCRIPTION" = "As legendas ainda não são suportadas durante as transmissões.";

// MARK: - MediaMoreOptionsActionSheet
"EQUALIZER_CELL_TITLE" = "Equalizador";
"MORE_OPTIONS_HEADER_TITLE" = "Opções de Vídeo";
"MORE_OPTIONS_HEADER_AUDIO_TITLE" = "Opções de áudio";
"BOOKMARKS_TITLE" = "Marcadores";
"ADD_BOOKMARKS_TITLE" = "Adicionar marcadores";
"BOOKMARK_DEFAULT_NAME" = "Marcador em";
"BOOKMARK_RENAME_TITLE" = "Mudar nome do marcador";
"BOOKMARK_DELETE_TITLE" = "Eliminar marcador";
"BOOKMARK_DELETE_MESSAGE" = "Confirmar a eliminação do marcador";
"INCREASE_BUTTON" = "Botão de aumentar";
"INCREASE_PLAYBACK_SPEED" = "Aumentar a velocidade de reprodução";
"INCREASE_AUDIO_DELAY" = "Aumentar o atraso do áudio";
"INCREASE_SUBTITLES_DELAY" = "Aumentar o atraso das legendas";
"DECREASE_BUTTON" = "Botão de diminuir";
"DECREASE_PLAYBACK_SPEED" = "Diminuir a velocidade de reprodução";
"DECREASE_AUDIO_DELAY" = "Diminuir o atraso do áudio";
"DECREASE_SUBTITLES_DELAY" = "Diminuir o atraso das legendas";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT" = "Mostrar o atalho da velocidade de reprodução";
"DISPLAY_PLAYBACK_SPEED_SHORTCUT_HINT" = "Ativar para mostrar o atalho da velocidade de reprodução";
"VIDEO_FILTERS_HINT" = "Selecione para abrir a vista de filtros de vídeo";
"PLAYBACK_SPEED_HINT" = "Selecione para abrir a vista da velocidade de reprodução";
"SUBTITLES_DELAY_HINT" = "Selecione para abrir a vista de atraso das legendas";
"AUDIO_DELAY_HINT" = "Selecione para abrir a vista de atraso de áudio";
"SLEEP_TIMER_HINT" = "Selecione para abrir a vista do temporizador de sono";
"EQUALIZER_HINT" = "Selecione para abrir a vista do equalizador";
"CHAPTERS_HINT" = "Selecione para abrir a vista de capítulos";
"BOOKMARKS_HINT" = "Selecione para abrir a vista de marcadores";
"INTERFACE_LOCK_HINT" = "Ativar a opção para bloquear a interface do utilizador";

// MARK: - Settings
"FORCE_RESCAN_TITLE" = "Forçar nova verificação da biblioteca de multimédia";
"FORCE_RESCAN_MESSAGE" = "Quer forçar o VLC a  verificar novamente a sua biblioteca multimédia?\nPode demorar algum tempo.";

"FEEDBACK_EMAIL_TITLE" = "Comentários sobre o VLC no iOS e no iPad";
"FEEDBACK_EMAIL_NOT_POSSIBLE_TITLE" = "Conta de correio eletrónico não configurada";
"FEEDBACK_EMAIL_NOT_POSSIBLE_LONG" = "Contacte-nos através de %@ de outro dispositivo.";

"SETTINGS_THEME_BLACK" = "Usar fundo preto no modo escuro";
"SETTINGS_THEME_BLACK_SUBTITLE" = "Melhora a duração da bateria em dispositivos com um ecrã OLED";

"SETTINGS_RESET_TITLE" = "Repor as definições";
"SETTINGS_RESET_MESSAGE" = "Quer repor todas as definições para os valores predefinidos?";

"SETTINGS_PLAY_ALL" = "Reprodução contínua para coleções";
"SETTINGS_PLAY_ALL_HINT" = "Ativar para reproduzir automaticamente o próximo ficheiro multimédia nos separadores de áudio ou vídeo";
"SETTINGS_PLAYLIST_PLAY_ALL" = "Reprodução contínua para listas de reprodução";
"SETTINGS_PLAYLIST_PLAY_ALL_HINT" = "Ativar para reproduzir automaticamente o próximo ficheiro multimédia de uma lista de reprodução";

"SETTINGS_DOCUMENTATION" = "Documentação";

// MARK: - Local Network

"SMBV1_WARN_TITLE" = "Aviso de ligação SMBv1";
"SMBV1_WARN_DESCRIPTION" = "Nós detetamos um protocolo antigo (SMBv1).\nTem a certeza que deseja continuar com o SMBv1?\nNós aconselhamos a atualização ou a alteração das definições do seu servidor.";
"SMBV1_CONTINUE" = "Continuar com SMBv1";
"SMBV1_NEXT_PROTOCOL" = "Experimentar SMBv2/v3";

// MARK: - Preview labels

"ENCODING" = "A codificar";

// MARK: - Media groups

"ADD_TO_MEDIA_GROUP" = "Adicionar ao grupo de média";
"ADD_TO_MEDIA_GROUP_HINT" = "Abrir o menu adicionar ao grupo de média";

"MEDIA_GROUPS" = "Grupos de média";
"MEDIA_GROUPS_DESCRIPTION" = "Escolha um título para o seu novo grupo de média";
"MEDIA_GROUPS_PLACEHOLDER" = "Título do grupo de média";

"REMOVE_FROM_MEDIA_GROUP" = "Remover do grupo de média";
"REMOVE_FROM_MEDIA_GROUP_HINT" = "Remover a seleção do grupo de média";

"MEDIA_GROUP_CREATION" = "Novo grupo de média";
"MEDIA_GROUP_CREATION_HINT" = "Mostrar alerta para criar uma lista de reprodução";
"MEDIA_GROUP_MOVE_TO_ROOT" = "Mover conteúdo para o nível mais alto";
"MEDIA_GROUP_MOVE_TO_ROOT_HINT" = "Move o conteúdo da seleção para o nível mais alto";

"BUTTON_REGROUP" = "Reagrupar";
"BUTTON_REGROUP_TITLE" = "Reagrupar seleção";
"BUTTON_REGROUP_HINT" = "Tentar reagrupar automaticamente uma única média.";
"BUTTON_REGROUP_DESCRIPTION" = "Tem a certeza que está a tentar reagrupar automaticamente uma única média?\nIsto pode demorar algum tempo.";

// MARK: - Files.app persistence file
"MEDIALIBRARY_FILES_PLACEHOLDER" = "Colocar os média aqui para os adicionar";
"MEDIALIBRARY_ADDING_PLACEHOLDER" = "A adicionar...";

// MARK: - QueueViewController

"PLAY_HINT" = "Reproduzir";
"PLAY_LABEL" = "Reproduzir";
"PLAY_NEXT_IN_QUEUE_HINT" = "Reproduzir o próximo na fila";
"PLAY_NEXT_IN_QUEUE_LABEL" = "Reproduzir o próximo na fila";
"APPEND_TO_QUEUE_HINT" = "Adicionar à fila";
"APPEND_TO_QUEUE_LABEL" = "Adicionar à fila";
"QUEUE_LABEL" = "Fila";

"DISPLAY_AS" = "Mostrar como";

/* New strings */
"BRIGHTNESS_HINT" = "Controlo vertical da luminosidade";
"BRIGHTNESS_SLIDER" = "Deslize verticalmente para alterar o nível de luminosidade";

/* New strings */
"VOLUME_HINT" = "Controlo vertical do volume";
"VOLUME_SLIDER" = "Deslize verticalmente para alterar o nível do volume";

// MARK: - AudioMiniPlayer playback controls menu
"MENU_PLAYBACK_CONTROLS" = "Controlos de reprodução";
"MENU_REPEAT_DISABLED" = "Não repetir";
"MENU_REPEAT_SINGLE" = "Repetir um";
"MENU_REPEAT_ALL" = "Repetir tudo";

// MARK: - ActionSheet

"ACTIONSHEET_BACKGROUND_LABEL" = "Fundo da folha de ação";
"ACTIONSHEET_BACKGROUND_HINT" = "Toque para remover a folha de ação.";

// MARK: - Donation
"DONATION_CUSTOM_AMOUNT" = "Introduzir montante personalizado";
"DONATION_TITLE" = "A privacidade acima do lucro";
"DONATION_DESCRIPTION" = "Multimédia privado e de fonte aberta, financiado por si. Sem anúncios, sem rastreio, sem compromissos. Gratuito para todos utilizarem. Faça um donativo agora para apoiar o VideoLAN.";
"DONATION_WINDOW_TITLE" = "Faça um donativo para o VideoLAN";
"DONATE_CC_DC" = "Cartão de crédito ou de débito";
"DONATION_CHOOSE_PP" = "Selecione o seu fornecedor de serviços de pagamento";
"DONATION_CHOOSE_CURRENCY" = "Selecione uma moeda";
"DONATION_AMOUNT" = "Montante do donativo: %@";
"DONATION_CC_NUM" = "Número do cartão de crédito";
"DONATION_CC_EXPIRY_DATE" = "Data de validade";
"DONATION_CC_EXPIRY_DATE_MONTH" = "MM";
"DONATION_CC_EXPIRY_DATE_YEAR" = "AA";
"DONATION_CC_CVV" = "CVV";
"DONATION_APPLE_PAY_NOT_POSSIBLE" = "Falha na configuração do Apple Pay";
"DONATION_APPLE_PAY_NOT_POSSIBLE_LONG" = "O VLC não conseguiu configurar o Apple Pay para efetuar o seu donativo. Para continuar, selecione outro fornecedor de pagamentos.";
"DONATION_DONATE_BUTTON" = "Doar";
"PURCHASE_FAILED" = "A compra falhou.";
"SEND_DONATION" = "Enviar o seu donativo";
"PURCHASE_SUCESS_TITLE" = "Donativo enviado";
"PURCHASE_SUCESS_DESCRIPTION" = "Obrigado pelo seu donativo!";
"DONATION_CONTINUE" = "Continuar";
"BUTTON_NOT_NOW" = "Agora não";
"DONATION_NAGSCREEN_TITLE" = "Doar hoje";
"DONATION_NAGSCREEN_SUBTITLE" = "Apoiar multimédia de fonte livre e aberta";
"DONATION_INVOICES" = "Faturas";
"DONATION_RECEIPTS" = "Recibos";
"DONATION_INVOICES_RECEIPTS" = "Faturas e recibos";
"DONATION_CHARGES_CLEARED_ON_REINSTALL" = "Se tiver reinstalado o VLC, as faturas ou recibos de doações anteriores não estarão disponíveis, uma vez que todas as suas informações pessoais são conservadas apenas neste dispositivo.\n\nSe tiver alguma dúvida, contacte-nos através do endereço donation@videolan.org e mencione este ID de utilizador anónimo: %@";
"DONATION_CANCEL_MONTHLY" = "Cancelar doação periódica";
"DONATION_MONTHLY" = "Mensal";
"DONATION_MONTHLY_FORMAT" = "%@/mês";
"DONATION_MONTHLY_VIDEOLAN" = "Donativo mensal para o VideoLAN";
"DONATION_ONCE" = "Uma vez";
"DONATION_UPDATE_MONTHLY" = "Atualizar a doação periódica";
"DONATION_VIDEOLAN" = "Donativo para o VideoLAN";
"DONATION_CANCEL_LONG" = "É com tristeza que vemos o cancelamento dos donativos mensais periódicas para o VideoLAN. O seu apoio anterior significava muito para nós. Muito obrigado!";
"DONATION_BANK_TRANSFER" = "Transferência bancária";
"DONATION_BANK_TRANSFER_LONG" = "O Stripe processa os donativos efetuados ao VideoLAN. O VideoLAN não conserva nem recolhe as suas informações pessoais.";
"DONATION_BUTTON_AGREE" = "Concordo";
"DONATION_IBAN" = "Número de conta bancária (IBAN)";
"DONATION_EMAIL" = "Email";
"DONATION_NAME" = "Nome";
"DONATION_NAME_BANK_ACCOUNT" = "Nome na conta bancária";
"DONATION_EMBARGOED_COUNTRY" = "Atualmente, não podemos aceitar donativos no seu país. Desfrute do VLC!";

// MARK: - Playback keyboard shortcuts

"KEY_JUMP_BACKWARDS" = "Saltar para trás";
"KEY_JUMP_FORWARDS" = "Saltar para a frente";
"KEY_INCREASE_PLAYBACK_SPEED" = "Aumentar velocidade de reprodução";
"KEY_DECREASE_PLAYBACK_SPEED" = "Diminuir velocidade de reprodução";
"KEY_RESET_PLAYBACK_SPEED" = "Repor a velocidade de reprodução";
"KEY_SEEK_TO_PERCENT" = "Procurar até %i%% da duração";

// MARK: - TitleSelection

"TITLESELECTION_BACKGROUND_LABEL" = "Fundo de seleção do título";
"TITLESELECTION_BACKGROUND_HINT" = "Toque para remover a vista.";

// MARK: - NEW DELETE STRINGS
"DELETE_SINGLE_TITLE" = "Eliminar \"%@\"?";
"DELETE_MULTIPLE_TITLE" = "Eliminar \"%@\" e outros %d ?";

// MARK: - AppIntent Strings
"APPINTENT_PLAY_MEDIA_TITLE" = "Reproduzir em segundo plano";
"APPINTENT_PLAY_MEDIA_DESCRIPTION" = "Reproduz a lista de reprodução selecionada em segundo plano sem abrir a aplicação.";
"APPINTENT_PLAY_MEDIA_PLAY_${mediaName}" = "Reproduzir ${mediaName} em segundo plano";

// MARK: - VerticalSliderControl Strings
"VERTICAL_SLIDER_CONTROL_ACCESSIBILITY_LABEL" = "Barra deslizante vertical";
"VERTICAL_SLIDER_CONTROL_INCREMENT_ACTION" = "Aumentar";
"VERTICAL_SLIDER_CONTROL_DECREMENT_ACTION" = "Diminuir";

// MARK: - Download Completion Announcement
"DOWNLOAD_COMPLETED_ANNOUNCEMENT" = "Transferência do ficheiro \"%@\" concluída";

//MARK: - Playlist Add Action Status
"ADD_TO_PLAYLIST_STATUS_MESSAGE" = "Adicionados %d ficheiros a %@";
"ADD_ALERT_TITLE" = "Seleção encontrada na lista de reprodução";
"ADD_ALERT_MESSAGE_SINGLE" = "Está a tentar adicionar um ficheiro que já faz parte do %@";
"ADD_ALERT_MESSAGE_MULTIPLE" = "Está a tentar adicionar %d ficheiros que já fazem parte do %@";

//MARK: - Last played playlist indicator
"LAST_PLAYED_PLAYLIST_LABEL_TITLE" = "Último reproduzido";
